cf_billing/Catalogs/энргМаршрутыКонтроллеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргМаршрутыКонтроллеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.энргСотрудники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АдресаМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КлючПомещений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргМаршрутыКонтроллеров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура КонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока  														= Элементы.АдресаМаршрута.ТекущиеДанные;
	
	СтандартнаяОбработка											= Ложь;
	МодульУправлениеКонтактнойИнформациейКлиент 					= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 								= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъекта"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
	
	ДанныеСтроки 													= Новый Структура("Представление,ЗначенияПолей",ТекСтрока.ЗначенияПолей,ТекСтрока.Представление);
	
	//ПараметрыФормыКонтактнойИнформации.ЗначенияПолей 				= ТекСтрока.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 				= ТекСтрока.Представление;
	
	Оповещение 														= Новый ОписаниеОповещения("АдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока",ТекСтрока));
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Ложь);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура АдресОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	текСтрока  									= ДополнительныеПараметры.текСтрока;
	текСтрока.Представление 					= РезультатЗакрытия.Представление;
	текСтрока.ЗначенияПолей 					= РезультатЗакрытия.КонтактнаяИнформация;		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргМаршрутыКонтроллеров(ЭтотОбъект);
	
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинамическихСписков()
	СсылкаМаршрутКонтролера = ?(Параметры.Ключ.Пустая(), Неопределено, Объект.Ссылка);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КлючиПомещений,						"МаршрутКонтролера", 						СсылкаМаршрутКонтролера);
КонецПроцедуры

#КонецОбласти
